# 1. 원화 변환기
"""
현재 원화를 입력하면 달러로 바뀌는 프로그램을 작성하세요!
예시 : 1410 -> $1
"""

# won = int(input("원화 입력:"))
# dollar = won/1410
# print(f"{won} -> ${dollar}")


# 2. 수학 연산 프로그램
'''
사용자로부터 두 개의 숫자를 입력받아, 
이 두 숫자에 대한 합, 차 곱, 몫, 나머지, 제곱을 계산하는 프로그램을 만들어보세요.
입력받은 두 숫자에 대해 다음과 같은 연산 결과를 출력해주는 프로그램을 작성해보세요!
예시 : 사용자 입력 : 12, 3
"합 : 15"
"차 : 9"
"곱 : 36"
"목 : 4"
"나머지 : 0"
"첫번째 수의 두번째 수 제곱 : 1728"
'''

# a = int(input("첫번째 정수 : "))
# b = int(input("두번째 정수 : "))
# print(f"합 : {a + b}, 차 : {a - b}, 곱 : {a * b}, 몫 : {a // b}, 나머지 : {a % b}, 첫번째수의 두번째수제곱 : {a ** b}")


# 3. 원의 반지름을 입력받아 넓이와 둘레 구하는 계산기 만들기

# radius = int(input("원의 반지름 :"))
# pi = 3.14159
# print(f"원의 넓이 : {radius**2*pi}, 원의 둘레 : {radius*2*pi}")





