# 정수 계산기

# 유저에게
# 첫번째 정수 입력 :
# 두번째 정수 입력 :
# 받은 후 두 수의 합을 출력하는 프로그램
# ex) 첫번째 정수 입력 : 5
#     두번째 정수 입력 : 3
#     결과 : 8

# n1 = input("첫번째 정수 입력")
# n2 = input("두번째 정수 입력")
# result = int(n1) + int(n2)
# print(f"결과 : {result}")


# 2. 나이를 통한 출생년도 알아내기
""" 사용자의 나이를 입력받아,
그 사람이 태어난 연도를 계산하여 출력하는 프로그램을 작성해보세요.
예시 : "나이가 20살이라면, 출생년도는 2003년입니다."
"""

# age = input("나이가?")
# a1 = int(2024)
# born = int(a1) - int(age)
# print(f"나이가 {age}살이라면, 출생년도는 {born}년입니다.")

# 3. 정사각형 넓이 계산 프로그램
""" 한 변의 길이를 입력받아, 
정사각형의 넓이를 구하는 프로그램을 만들어보세요.
예시 : "한 변의 길이가 4cm라면, 넓이는 16cm²입니다."
"""

# a = input("정사각형 한 변의 길이는?")
# result = int(a) * int(a)
# print(f"한 변의 길이가 {a}cm라면, 넓이는 {result}cm²입니다.")




# 4. 시간 변환
""" 입력받은 숫자(0~10000사이)를 초 단위로 간주하고, 
이를 분과 초로 변환하는 퀴즈를 만들어보세요.
"""

