# 1. 어제의 일기 프로그램
""" 어제의 날짜와 그리고 하루 동안 있었던 주요 사건을 입력받아,
이를 종합하여 어제의 일기를 작성하는 프로그램을 만들어보세요! """

# a = input("어제의 날짜는?")
# b = input("주요 사건은?")
# print(f"어제는 {a}, 주요 사건은 {b} 였습니다!")


# 2. 아침, 점심, 저녁 먹은 메뉴 보여주기 프로그램
""" 오늘의 날짜와 아침, 점심, 저녁에 먹은 메뉴를 입력받아,
오늘은 '[날짜], 아침에는 [아침 메뉴], 점심에는 [점심 메뉴], 저녁에는 [저녁 메뉴]를 먹었습니다.'
라고 알려주는 프로그램을 작성해보세요! """

# 날짜 = input("오늘의 날짜는?")
# 아침메뉴 = input("오늘 먹은 아침 메뉴는?")
# 점심메뉴 = input("오늘 먹은 점심 메뉴는?")
# 저녁메뉴 = input("오늘 먹은 저녁 메뉴는?")
# print(f"오늘은 {날짜}, 아침에는 {아침메뉴}, 점심에는 {점심메뉴}, 저녁에는 {저녁메뉴}를 먹었습니다.")