# 1. 정삼각형의 넓이 계산 프로그램
'''
예시 : 사용자 입력:
밑변: 5
높이: 10
프로그램 출력:
정삼각형의 넓이는 25입니다
'''

# a = int(input("밑변:"))
# b = int(input("높이:"))
# c = int(a * b / 2)
# print(f"정삼각형의 넓이는 {c}입니다")


# 2. 정수의 속성 판별 프로그램
'''
예시: 
사용자 입력:3
프로그램 출력: 양수이며 홀수입니다
사용자 입력:2
프로그램 출력: 양수가 아니거나 홀수가 아닙니다
'''

# num = float(input("사용자 입력:"))
# if not num % 2 == 0 and num >= 0:
#     print(f"양수이며 홀수입니다")
# else:
#     print("양수가 아니거나 홀수가 아닙니다")


# 3. 과일 이름의 알파벳 검사 프로그램
'''
예시: 
사용자 입력: Apple
프로그램 출력: 해당 과일 이름에 'a'가 포함되는군요!
사용자 입력: Kiwi
프로그램 출력: 'a'가 포함되지 않는군요!
'''

# fruit = input("사용자 입력:")

# if 'a' in fruit:
#     print("해당 과일 이름에 'a'가 포함되는군요!")
# else:
#     print("'a'가 포함되지 않는군요!")